TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ЛогЗапросовАсинхронныхСервисов/гкс_ЛогЗапросовАсинхронныхСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ЛогЗапросовАсинхронныхСервисов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ХранилищеЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеОтвета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиИнтеграционногоАдаптера/гкс_НастройкиИнтеграционногоАдаптера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НастройкиИнтеграционногоАдаптера</name>
  <resources>
    <name>МаксимальноеКоличествоПотоковОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерПорцииОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияВходящихСообщений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияИсходящихСообщений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияЛогаЗапросовАсинхронногоСервиса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияСообщенийСОшибкамиОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтрокаСоединенияУчастникаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТаймаутОбработкиПорцииСообщений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоНеудачныхОбработок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерПорцииОбработкиОчередиОтложенногоФормирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоПотоковОбработкиОчередиОтложенногоФормирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТаймаутОбработкиПорцииОчередиОтложенногоФормирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияОчередиОтложенногоФормирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОтдельнуюСхемуДляСлужебныхСообщений</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипПодключенияИзолированно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеОбработкиСообщенийПоТочкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ЛогЗапросовАсинхронныхСервисов/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает запись вызова web-сервиса. Записывает представления запроса и ответа,
//	время выполнения, и идентифицирующую вызов информацию.
//
// Параметры:
//	- Пользователь - СправочникСсылка.Пользователи. Пользователь вызвавший запрос.
//	- НомерСеанса - число. Номер сеанса в котором произошел вызов.
//	- ОтметкаВремени - дата.
//	- Длительность  - дата. Длительность в миллисекундах.
//	- Запрос - ОбъектXDTO. Обрабатываемый запрос.
//	- Ответ  - ОбъектXDTO. Результат обработки запроса.
//
Процедура ЗаписатьВЛог(Знач Запись) Экспорт
	
	СжатиеДанных = Новый СжатиеДанных(9);
	НаборЗаписей = РегистрыСведений.гкс_ЛогЗапросовАсинхронныхСервисов.СоздатьНаборЗаписей();
	
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(ЗаписьНабора, Запись);
		
	Запрос = Запись.Запрос;
	Если НЕ ТипЗнч(Запрос) = Тип("Строка") Тогда
		Запрос = Серилиализовать(Запрос);
	КонецЕсли;
	ЗаписьНабора.ХранилищеЗапроса = Новый ХранилищеЗначения(Запрос, СжатиеДанных);
	
	Ответ = Запись.Ответ;
	Если НЕ ТипЗнч(Ответ) = Тип("Строка") Тогда
		Ответ = Серилиализовать(Ответ);
	КонецЕсли;
	ЗаписьНабора.ХранилищеОтвета = Новый ХранилищеЗначения(Ответ, СжатиеДанных);
	
	Попытка
		НаборЗаписей.Записать(Ложь);
		
	Исключение
		ВызватьИсключение ОписаниеОшибки();
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СократитьЗаписиЛога() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.Текст = ТекстЗапросаСокращениеЗаписейЛога();
	
	Результат = Запрос.Выполнить();
	Пока НЕ Результат.Пустой() Цикл
		
		НаборЗаписей = РегистрыСведений.гкс_ЛогЗапросовАсинхронныхСервисов.СоздатьНаборЗаписей();

		НачатьТранзакцию();
		Попытка
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
				НаборЗаписей.Записать();
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение ОписаниеОшибки();
			
		КонецПопытки;
		
		Результат = Запрос.Выполнить();
		
	КонецЦикла;
	
КонецПроцедуры

Функция Серилиализовать(Знач Значение)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение, , ,НазначениеТипаXML.Явное);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаСокращениеЗаписейЛога() 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Лог.Период КАК Период
	|ИЗ
	|	РегистрСведений.гкс_ЛогЗапросовАсинхронныхСервисов КАК Лог
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_НастройкиИнтеграционногоАдаптера КАК гкс_НастройкиИнтеграционногоАдаптера
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Лог.Период < ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -ЕСТЬNULL(гкс_НастройкиИнтеграционногоАдаптера.СрокХраненияЛогаЗапросовАсинхронногоСервиса, 0))";
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
